Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NodePropertyNotSet Property
 The calculation could not be executed as configured. Specify a constraint property set for the following input or output node(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NodePropertyNotSet { get; }
Public Shared ReadOnly Property Network_NodePropertyNotSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NodePropertyNotSet {
	FailureDefinitionId^ get ();
}
static member Network_NodePropertyNotSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace